app/Models/MemberModel.php

SELECT *
FROM `members`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `members`
---
    public function getPaginatedMembers($perPage = 5, $search = null)
    {
        if ($search) {
            $this->groupStart()
                ->like('first_name', $search)
                ->orLike('last_name', $search)
                ->orLike('username', $search)
                ->orLike('email', $search)
                ->groupEnd();
        }

        return $this->paginate($perPage);

SELECT *
FROM `members`
ORDER BY `joined_at` DESC
 LIMIT 5
---
    public function getNewest(int $limit = 4): array
    {
        return $this->orderBy('joined_at', 'DESC')->limit($limit)->findAll();

SELECT *
FROM `members`
ORDER BY `points` DESC
 LIMIT 4
---
    public function getMostActive(int $limit = 4): array
    {
        return $this->orderBy('points', 'DESC')->limit($limit)->findAll();